morria/pocket-cat/esp32s3/firmware/sdkconfig.defaults
# CAT bridge — XIAO ESP32S3 (docs/implementation.md §2/§3)
CONFIG_IDF_TARGET="esp32s3"

# Console on UART0 (GPIO43/44): native USB is occupied by host mode (§2.1).
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# 1 ms tick for tight coalescer flush timing (§5.3).
CONFIG_FREERTOS_HZ=1000

# NimBLE peripheral only (§4, references/firmware-nimble-ble.md).
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_NVS_PERSIST=y
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=247
CONFIG_BT_NIMBLE_MAX_BONDS=1

# Watchdog on the bridge task (§5.5).
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# 8 MB flash on the XIAO ESP32S3 module.
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Composite CDC + UAC descriptors (QMX with its sound card) exceed the
# 256-byte default and would fail enumeration before radio_detect runs
# (docs/qmx-panadapter.md §5.1).
CONFIG_USB_HOST_CONTROL_TRANSFER_MAX_SIZE=1024
